package HomeTask_2;

/*
Составьте программу, выводящую на экран квадраты чисел от 10 до 20
включительно.
 */
public class HomeTask_2_3 {
    public static void main(String[] args) {

        for (int a = 10; a <= 20; a++) {
            System.out.print(a * a + " ,");
        }
    }
}
